# RbsEnergyAnalysisIncludeThermalProperties Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..RbsEnergyAnalysisIncludeThermalProperties Property
ParameterTypeId Class See Also
---
"Detailed Elements"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId RbsEnergyAnalysisIncludeThermalProperties { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property RbsEnergyAnalysisIncludeThermalProperties As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ RbsEnergyAnalysisIncludeThermalProperties {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace